var admin = require("firebase-admin"); //firebase admin SDK
var serviceAccount = require("./config/firebase-adminsdk.json"); //firebase admin requires .json auth
var databaseURL = require("./config/firebaseAdminDatabaseUrl.js");
admin.initializeApp({
    credential: admin.credential.cert(serviceAccount),
    databaseURL: databaseURL.url
});
var set = require("./models/linetemplate");

  let columns = [
    {
      "title": '特殊問題',
      "text": '請點選欲問之問題',
      "actions": [
        {
          "type": "message",
          "label": '何為代收轉付收據',
          "text": "何為代收轉付收據"
        },
        {
          "type": "message",
          "label": ' ',
          "text": " "
        },
        {
          "type": "message",
          "label": '國旅卡相關問題',
          "text": "國旅卡相關問題"
        }
      ]
    }
  ];
  set.set("特殊問題", {
    "type": "template",
    "altText": "特殊問題",
    "template": {
      'type': 'carousel',
      "columns": columns
    }
  });

let specific_questions = [
  {
    "Q": "何為代收轉付收據",
    "A": '根據交通部觀光局和財政部國稅局的規定,由於是屬於轉手業務,所以旅行社不適用於發票!\n'
    +'只能開立蓋有公司統一發票章的代收轉付收據!\n'
    +'也因為如此,所以旅行社在收受客人的付款之後,必須將錢轉付與航空公司、飯店、餐廳、購買門票等等、而旅行社與航空公司、飯店、餐廳、購買門票之間也沒有發票的往來!\n'
    +'也只是一張上面蓋有統一發票章的代收轉付收據,因此相對的旅行社開給客人的也只是一張上面蓋有統一發票章的!\n'
    +'可是不要小看這張代收轉付收據喔!\n'
    +'它除了不能對獎之外,效用等同統一發票喔!'
  },
  {
    "Q": "國旅卡相關問題",
    "A":'＊公務人員休假時於旅宿業國民旅遊卡特約商店刷卡消費，則相連假日之刷卡消費得否請領補助？與休假期間之相連假日住宿，是否符合補助規定？\n'
    +'Ａ：自 106年 3月 1日起，公務人員於與休假期間之相連假日，於旅宿業國民旅遊卡特約商店住宿刷卡消費，除給予核實補助外\n'
    +'該休假期間及其相連假日之連續期間於各國民旅遊卡特約商店之刷卡消費，得按其行業別核實併入觀光旅遊額度或自行運用額度之補助範圍。\n'
    +'公務人員週五請休假，且於週六住宿於旅宿業國民旅遊卡特約商店（週六住宿，週日退房），除該筆住宿費用於觀光旅遊額度核實補助外，\n'
    +'週五至週日之連續期間於各國民旅遊卡特約商店之刷卡消費，均得按其行業別核實併入觀光旅遊額度或自行運用額度之補助範圍。\n\n'
    +'＊使用國民旅遊卡刷卡消費，其刷卡日與實際消費日（休假期間或與休假期間相連假日之連續期間）不同之預購型交易，應如何核銷？\n'
    +'Ａ：預購休假期間或與休假期間相連假日之連續期間之交通票券或旅遊套裝行程等預購型交易，其刷卡日期與實際消費日期不同，\n'
    +'特18約商店將使用網際網路服務為持卡人鍵入收單機構代號、特約商店代號、卡號、消費金額、消費日、授權碼、行程起迄日、旅遊地等資料，\n'
    +'至「國民旅遊卡檢核系統」中，經檢核系統比對特約商店鍵入之資料如符合於休假期間或與休假期間相連假日之連續期間以國民旅遊卡在特約商店刷卡消費等條件，\n'
    +'該筆預購型交易，得依休假改進措施規定，按其行業別核實併入觀光旅遊額度或自行運用額度之補助範圍，請於消費時提醒特約商店上開事項，方可正確檢核交易。\n\n'
    +'＊如預購明年初之觀光旅遊行程，而跨年度適逢機關簽約之發卡機構變更，刷卡付款時，究應使用哪張國民旅遊卡？\n'
    +'Ａ：如跨年度適逢機關簽約之國民旅遊卡發卡機構變更，則應以各該年度有效之國民旅遊卡刷卡消費。\n'
    +'是以，如於今年度預購明年之觀光旅遊行程且符合休假補助相關規定，仍應以今年有效之國民旅遊卡刷卡，惟於明年度之強制休假補助費額度內予以補助。\n\n'
    +'＊購買預購型商品時，是否要請休假刷卡?\n'
    +'A：購買預購型商品時，毋須請休假刷卡，惟實際消費日須符合休假改進措施之相關規定（休假期間或與休假期間相連假日之連續期間）。'
  },
];
for( let i=0; i<specific_questions.length; i++ ) {
  let data = specific_questions[i];
  let q = data.Q;
  let a = data.A;
  set.set(q, {
    "type": "text",
    "altText": a,
    "text": a
  });

}

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",

// set.set("",
